rkz/extension/Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СерииНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Цвет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Цвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Партия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВидЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ТипОбшивкиБарабана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ТипБарабана</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Брутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесПродукции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесОбшивки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ВесБарабана</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПрежнийНомерТары</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Намотки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПереченьДлинНаБарабане</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

rkz/extension/InformationRegisters/бит_ЗначенияПризнаковНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>бит_ЗначенияПризнаковНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ПризнакиНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПризнакСертификации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Признак</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ПризнакиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

rkz/extension/Catalogs/СерииНоменклатуры/Forms/бит_ФормаАтрибутыТары/Ext/Form/Module.bsl
//{{******************************}}//
  //{{         БИТ ЛТ5.37			}}//
  //{{******************************}}//
  
&НаКлиенте
Процедура бит_ПереченьДлинНаБарабанеПриИзменении(Элемент)

	ПереченьДлинНаБарабанеПриИзмененииНаКлиенте();  
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьДлинНаБарабанеПриИзмененииНаКлиенте()
	
	мДлин = Новый Массив;
	Для каждого стр из Объект.бит_ПереченьДлинНаБарабане Цикл
		Если стр.Длина = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		мДлин.Добавить(стр.Длина);
	КонецЦикла;
	Объект.бит_Намотки = СтрСоединить(мДлин, "+"); 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Документ 	 = Параметры.Документ;
	Количество 	 = Параметры.КоличествоУпаковок;	 
	Назначение 	 = Параметры.Назначение;
	Номенклатура = Параметры.Номенклатура;
	НомерСтроки  = Параметры.НомерСтроки;
	Упаковка 	 = Параметры.Упаковка;
	ВидНоменклатуры = Номенклатура.ВидНоменклатуры;
	
	ЗаполнитьВидЗаказа(); 
	
	ЗаполнитьВесПродукции();
	
	НастройкиИспользованияСерий = Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(ВидНоменклатуры);
	Для Каждого Реквизит Из НастройкиИспользованияСерий.ОписанияИспользованияРеквизитовСерии Цикл
		Если Элементы.Найти(Реквизит.ИмяРеквизита) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Реквизит.Использование = Ложь Тогда
			Элементы[Реквизит.ИмяРеквизита].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;  
	
	Элементы.ГруппаПереченьДлин.Видимость = Элементы.бит_Намотки.Видимость;
	Элементы.грПрочее.Видимость = Элементы.бит_ПережнийНомерТары.Видимость Или Элементы.бит_НомерЗаказа.Видимость;
	Элементы.ГруппаВес.Видимость = Элементы.бит_Брутто.Видимость Или Элементы.бит_ВесПродукции.Видимость
									или Элементы.бит_ВесОбшивки.Видимость Или Элементы.бит_ВесБарабана.Видимость;   
	Элементы.Группа5.Видимость = Элементы.бит_ТипБарабана.Видимость 
								Или Элементы.ГруппаВес.Видимость
								Или Элементы.ГруппаПереченьДлин.Видимость;
	Элементы.Группа3.Видимость = Элементы.Группа5.Видимость Или Элементы.бит_Примечание.Видимость;   
	Элементы.Группа1.Видимость = Элементы.бит_ВидЗаказа.Видимость Или Элементы.бит_Партия.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВесПродукции()
	
	Если ЗначениеЗаполнено(Объект.бит_ВесПродукции) Тогда
		Возврат;
	КонецЕсли;
	//Длина 7. Точность 0. Расчетная сумма. Если не заполнен. Рассчитывается исходя из количества по строке и реквизита "Вес карточки номенклатуры"
	Объект.бит_ВесПродукции = Количество * Номенклатура.ВесЧислитель / ?(ЗначениеЗаполнено(Номенклатура.ВесЗнаменатель), Номенклатура.ВесЗнаменатель, 1);
	ПересчитатьБрутто();
		
КонецПроцедуры  

&НаСервере
Процедура СформироватьОписание()

//Не редактируемая. Выводит по текущей строке
// Номер строки
// Наименование позиции
//Наименование и номер документа в котором корректируется строка
//Количество по выбранной строке
//Заказ клиента, заполняется и записывается когда в документе указано назначение. Заказ берется из назначения.
Описание = СтрШаблон("Строка %1; %2; Документ: %3; Количество: %4 %5; Назначение: %6", НомерСтроки, Номенклатура, Документ, Количество, Упаковка, Заказ);

КонецПроцедуры           

&НаСервере
Процедура ЗаполнитьВидЗаказа() 
	
	//ВидЗаказ = если не заполнено. 
	// ищу беру этап производства. ТЧ выпуск. там назначение.  
	// если в назначении заказ клиента то 99, если заказ давальца то 97. иначе пусто.	
	Если ЗначениеЗаполнено(Объект.бит_ВидЗаказа) И ЗначениеЗаполнено(Заказ) Тогда
		Возврат;
	КонецЕсли; 
	Если Назначение = Неопределено Или Не ЗначениеЗаполнено(Назначение.Заказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Назначение.Заказ) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		бит_ВидЗаказа = 99;               
		НомерЗаказа = Назначение.Заказ.Номер;
	ИначеЕсли ТипЗнч(Назначение.Заказ) = Тип("ДокументСсылка.ЗаказДавальца2_5") Тогда 
		бит_ВидЗаказа = 97;               
		НомерЗаказа = Назначение.Заказ.Номер;
	Иначе               
		бит_ВидЗаказа = 0;                
		НомерЗаказа = "";
	КонецЕсли;  
	Если ЗначениеЗаполнено(бит_ВидЗаказа) и Не ЗначениеЗаполнено(Объект.бит_ВидЗаказа) Тогда
		Объект.бит_ВидЗаказа = бит_ВидЗаказа;
	КонецЕсли;     
	Если ЗначениеЗаполнено(Заказ) И Не ЗначениеЗаполнено(Объект.бит_НомерЗаказа) Тогда
		Объект.бит_НомерЗаказа = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(НомерЗаказа, Истина, Истина); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура бит_ВесПродукцииПриИзменении(Элемент)
	
	ПересчитатьБрутто();
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВесОбшивкиПриИзменении(Элемент)
	
	ПересчитатьБрутто();
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ВесБарабанаПриИзменении(Элемент)
	
	ПересчитатьБрутто();  
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ТипБарабанаПриИзменении(Элемент)
	
	ПересчитатьВесБарабана();
	ПересчитатьБрутто();
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ТипОбшивкиБарабанаПриИзменении(Элемент)
	
	ПересчитатьВесОбшивки();
	ПересчитатьБрутто(); 
	
КонецПроцедуры 

&НаСервере
Процедура ПересчитатьБрутто()
	
	Объект.бит_Брутто = Объект.бит_ВесБарабана + Объект.бит_ВесПродукции + Объект.бит_ВесОбшивки;
	
КонецПроцедуры 

&НаСервере
Процедура ПересчитатьВесОбшивки()
	
	Объект.бит_ВесОбшивки = Объект.бит_ТипОбшивкиБарабана.ВесЧислитель / ?(Объект.бит_ТипОбшивкиБарабана.ВесЗнаменатель = 0, 1, Объект.бит_ТипОбшивкиБарабана.ВесЗнаменатель);

КонецПроцедуры

&НаСервере
Процедура ПересчитатьВесБарабана()
	
	Объект.бит_ВесБарабана = 0;
	Если ЗначениеЗаполнено(Объект.бит_ТипБарабана) Тогда
		ПризнакВесНетто = Справочники.бит_ЗначенияПоУмолчанию.ПризнакВесНетто;
		Если Не ЗначениеЗаполнено(ПризнакВесНетто.Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить признак Вес Нетто", ПризнакВесНетто);
		Иначе                        
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Значение КАК Значение
			                      |ИЗ
			                      |	РегистрСведений.бит_ЗначенияПризнаковНоменклатуры КАК бит_ЗначенияПризнаковНоменклатуры
			                      |ГДЕ
			                      |	бит_ЗначенияПризнаковНоменклатуры.бит_Номенклатура = &бит_Номенклатура
			                      |	И бит_ЗначенияПризнаковНоменклатуры.бит_Признак = &бит_Признак
			                      |	И Не бит_ЗначенияПризнаковНоменклатуры.бит_ПризнакСертификации"); 
			Запрос.УстановитьПараметр("бит_Номенклатура", Объект.бит_ТипБарабана);
			Запрос.УстановитьПараметр("бит_Признак", ПризнакВесНетто.Значение);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				Объект.бит_ВесБарабана = Выборка.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                 
	
	СнятьМодифицированность = Не ЭтаФорма.Модифицированность;
	СформироватьОписание();                                  
	Если СнятьМодифицированность ТОгда
		Модифицированность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ПереченьДлинНаБарабанеДлинаПриИзменении(Элемент)

	ТД = Элементы.бит_ПереченьДлинНаБарабане.ТекущиеДанные;
	Если ТД <> Неопределено И ТД.Длина = 0 Тогда    
		Объект.бит_ПереченьДлинНаБарабане.Удалить(Элементы.бит_ПереченьДлинНаБарабане.ТекущаяСтрока);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Количество <> Объект.бит_ПереченьДлинНаБарабане.Итог("Длина") Тогда
		ПонятоПринято = ПредупреждениеАсинх("Общее количество не совпадает с суммой длин на барабане", , "Внимание!");
		Результат = Ждать ПонятоПринято;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВнестиНесколькоДлин(Команда)
	// {{ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:30:30] +        
	ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.бит_ФормаНесколькоДлин", , ЭтаФорма, УникальныйИдентификатор, , , Новый ОписаниеОповещения("ПослеВводаНесколькихДлин", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    // }}ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:30:30] -
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаНесколькихДлин(ВыбЗначение, ДопПарам) Экспорт 
	// {{ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:31:10] +        
	Если ВыбЗначение <> Неопределено Тогда
		Для сч = 1 по ВыбЗначение.КоличествоДлин Цикл
			Нов = Объект.бит_ПереченьДлинНаБарабане.Добавить();
			Нов.Длина = ВыбЗначение.ДлинаОтрезка;
		КонецЦикла;
	КонецЕсли; 
	
	ПереченьДлинНаБарабанеПриИзмененииНаКлиенте();
	// }}ПервыйБИТ ЛистТребований [ЛТ5.42]  [VUVaynula@1cbit.ru] [06.09.2025 15:31:10] -
КонецПроцедуры
